#### Terraform dev Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.media_api.data.archive_file.device_tokens: Reading...
module.media_api.data.archive_file.media_uploads: Reading...
module.media_api.data.archive_file.device_tokens: Read complete after 0s [id=dcda632ad0d073ae8f3b8930a4eb08465b971cb6]
module.media_api.data.archive_file.media_uploads: Read complete after 0s [id=ab5e335f198e5fee406cc2ba14b8806f46cfba85]
module.media_api.data.aws_region.current: Reading...
module.media_api.aws_api_gateway_rest_api.media: Refreshing state... [id=vtz8vfq85g]
module.media_storage.data.aws_caller_identity.current: Reading...
module.media_api.aws_iam_role.create_upload_record: Refreshing state... [id=cloud-photos-dev-create-upload-record-role]
module.identity_pool.data.aws_region.current: Reading...
module.push_notification.aws_secretsmanager_secret.firebase_credentials: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:***:secret:cloud-photos-firebase-credentials-dev-6QpS59]
module.media_db.aws_dynamodb_table.upload_records: Refreshing state... [id=cloud-photos-upload-records-dev]
module.device_token_db.aws_dynamodb_table.device_tokens: Refreshing state... [id=cloud-photos-device-tokens-dev]
module.media_api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.identity_pool.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.media_api.aws_iam_role.get_upload_records: Refreshing state... [id=cloud-photos-dev-get-upload-records-role]
module.media_api.aws_cloudwatch_log_group.lambda["create_upload_record"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-create-upload-record]
module.media_api.aws_cloudwatch_log_group.lambda["delete_upload_record"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-delete-upload-record]
module.media_api.aws_iam_role.delete_upload_record: Refreshing state... [id=cloud-photos-dev-delete-upload-record-role]
module.media_storage.data.aws_caller_identity.current: Read complete after 1s [id=***]
module.media_api.aws_cloudwatch_log_group.lambda["get_upload_records"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-get-upload-records]
module.cognito.aws_cognito_user_pool.main: Refreshing state... [id=ap-northeast-1_MqADoAEeB]
module.media_api.data.aws_caller_identity.current: Reading...
module.media_storage.aws_s3_bucket.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.media_api.data.aws_caller_identity.current: Read complete after 0s [id=***]
module.media_api.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-vtz8vfq85g-DEFAULT_4XX]
module.media_api.aws_api_gateway_resource.media: Refreshing state... [id=eh1ehu]
module.media_api.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-vtz8vfq85g-DEFAULT_5XX]
module.media_api.aws_api_gateway_resource.uploads: Refreshing state... [id=v3prx5]
module.media_api.aws_iam_role_policy.create_upload_record_logs: Refreshing state... [id=cloud-photos-dev-create-upload-record-role:cloudwatch-logs]
module.media_api.aws_iam_role_policy.delete_upload_record_logs: Refreshing state... [id=cloud-photos-dev-delete-upload-record-role:cloudwatch-logs]
module.media_api.aws_iam_role_policy.get_upload_records_logs: Refreshing state... [id=cloud-photos-dev-get-upload-records-role:cloudwatch-logs]
module.media_api.aws_api_gateway_resource.upload_item: Refreshing state... [id=xbfdej]
module.media_api.aws_api_gateway_method.get_uploads: Refreshing state... [id=agm-vtz8vfq85g-v3prx5-GET]
module.media_api.aws_api_gateway_method.post_uploads: Refreshing state... [id=agm-vtz8vfq85g-v3prx5-POST]
module.media_api.aws_api_gateway_method.options_uploads: Refreshing state... [id=agm-vtz8vfq85g-v3prx5-OPTIONS]
module.media_api.aws_api_gateway_method.options_upload_item: Refreshing state... [id=agm-vtz8vfq85g-xbfdej-OPTIONS]
module.media_api.aws_api_gateway_method.delete_upload: Refreshing state... [id=agm-vtz8vfq85g-xbfdej-DELETE]
module.media_api.aws_api_gateway_method_response.options_uploads: Refreshing state... [id=agmr-vtz8vfq85g-v3prx5-OPTIONS-200]
module.media_api.aws_api_gateway_integration.options_uploads: Refreshing state... [id=agi-vtz8vfq85g-v3prx5-OPTIONS]
module.cognito.aws_cognito_user_pool_client.main: Refreshing state... [id=3uf318v7h781gvs5rbrf7af932]
module.media_api.aws_api_gateway_method_response.options_upload_item: Refreshing state... [id=agmr-vtz8vfq85g-xbfdej-OPTIONS-200]
module.media_api.aws_api_gateway_integration.options_upload_item: Refreshing state... [id=agi-vtz8vfq85g-xbfdej-OPTIONS]
module.media_api.aws_api_gateway_integration_response.options_uploads: Refreshing state... [id=agir-vtz8vfq85g-v3prx5-OPTIONS-200]
module.identity_pool.aws_cognito_identity_pool.main: Refreshing state... [id=ap-northeast-1:23316fc9-592e-4a7b-9a8a-c33a446faf78]
module.media_api.aws_iam_role_policy.create_upload_record_dynamodb: Refreshing state... [id=cloud-photos-dev-create-upload-record-role:dynamodb-put]
module.media_api.aws_iam_role_policy.delete_upload_record_dynamodb: Refreshing state... [id=cloud-photos-dev-delete-upload-record-role:dynamodb-delete]
module.media_api.aws_lambda_function.get_upload_records: Refreshing state... [id=cloud-photos-dev-get-upload-records]
module.media_api.aws_lambda_function.delete_upload_record: Refreshing state... [id=cloud-photos-dev-delete-upload-record]
module.media_api.aws_iam_role_policy.get_upload_records_dynamodb: Refreshing state... [id=cloud-photos-dev-get-upload-records-role:dynamodb-query]
module.media_api.aws_lambda_function.create_upload_record: Refreshing state... [id=cloud-photos-dev-create-upload-record]
module.media_api.aws_api_gateway_integration_response.options_upload_item: Refreshing state... [id=agir-vtz8vfq85g-xbfdej-OPTIONS-200]
module.identity_pool.aws_iam_role.authenticated: Refreshing state... [id=cloud-photos-cognito-authenticated-dev]
module.identity_pool.aws_iam_role_policy.authenticated_api: Refreshing state... [id=cloud-photos-cognito-authenticated-dev:media-api-access]
module.identity_pool.aws_cognito_identity_pool_roles_attachment.main: Refreshing state... [id=ap-northeast-1:23316fc9-592e-4a7b-9a8a-c33a446faf78]
module.media_api.aws_lambda_permission.post_uploads: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_integration.post_uploads: Refreshing state... [id=agi-vtz8vfq85g-v3prx5-POST]
module.media_api.aws_lambda_permission.get_uploads: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_integration.get_uploads: Refreshing state... [id=agi-vtz8vfq85g-v3prx5-GET]
module.media_api.aws_lambda_permission.delete_upload: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_integration.delete_upload: Refreshing state... [id=agi-vtz8vfq85g-xbfdej-DELETE]
module.media_api.aws_api_gateway_deployment.media: Refreshing state... [id=lq2p3l]
module.media_api.aws_api_gateway_stage.media: Refreshing state... [id=ags-vtz8vfq85g-dev]
module.media_storage.aws_s3_bucket_server_side_encryption_configuration.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.identity_pool.aws_iam_role_policy.authenticated_s3: Refreshing state... [id=cloud-photos-cognito-authenticated-dev:media-storage-access]
module.media_storage.aws_s3_bucket_public_access_block.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.media_storage.aws_s3_bucket_versioning.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.media_storage.aws_s3_bucket_lifecycle_configuration.media: Refreshing state... [id=***-cloud-photos-media-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.identity_pool.aws_iam_role_policy.authenticated_api will be updated in-place
  ~ resource "aws_iam_role_policy" "authenticated_api" {
        id          = "cloud-photos-cognito-authenticated-dev:media-api-access"
        name        = "media-api-access"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (2 unchanged elements hidden)
                            "arn:aws:execute-api:ap-northeast-1:***:vtz8vfq85g/*/DELETE/media/uploads/*",
                          + "arn:aws:execute-api:ap-northeast-1:***:vtz8vfq85g/*/PUT/devices/token",
                          + "arn:aws:execute-api:ap-northeast-1:***:vtz8vfq85g/*/DELETE/devices/token",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_deployment.media must be replaced
+/- resource "aws_api_gateway_deployment" "media" {
      ~ created_date = "2026-03-14T01:45:48Z" -> (known after apply)
      ~ id           = "lq2p3l" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "63d3febc2034d134ab90597ae05dcd5b4ef87f56"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_gateway_response.default_4xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {
        id                  = "aggr-vtz8vfq85g-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_gateway_response.default_5xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_5xx" {
        id                  = "aggr-vtz8vfq85g-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_integration.delete_devices_token will be created
  + resource "aws_api_gateway_integration" "delete_devices_token" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "DELETE"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "vtz8vfq85g"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.media_api.aws_api_gateway_integration.options_devices_token will be created
  + resource "aws_api_gateway_integration" "options_devices_token" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = "vtz8vfq85g"
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.media_api.aws_api_gateway_integration.put_devices_token will be created
  + resource "aws_api_gateway_integration" "put_devices_token" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PUT"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "vtz8vfq85g"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.media_api.aws_api_gateway_integration_response.options_devices_token will be created
  + resource "aws_api_gateway_integration_response" "options_devices_token" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token,X-Amz-User-Agent'"
          + "method.response.header.Access-Control-Allow-Methods" = "'PUT,DELETE,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "vtz8vfq85g"
      + status_code         = "200"
    }

  # module.media_api.aws_api_gateway_method.delete_devices_token will be created
  + resource "aws_api_gateway_method" "delete_devices_token" {
      + api_key_required = false
      + authorization    = "AWS_IAM"
      + http_method      = "DELETE"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "vtz8vfq85g"
    }

  # module.media_api.aws_api_gateway_method.options_devices_token will be created
  + resource "aws_api_gateway_method" "options_devices_token" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "vtz8vfq85g"
    }

  # module.media_api.aws_api_gateway_method.put_devices_token will be created
  + resource "aws_api_gateway_method" "put_devices_token" {
      + api_key_required = false
      + authorization    = "AWS_IAM"
      + http_method      = "PUT"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "vtz8vfq85g"
    }

  # module.media_api.aws_api_gateway_method_response.options_devices_token will be created
  + resource "aws_api_gateway_method_response" "options_devices_token" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "vtz8vfq85g"
      + status_code         = "200"
    }

  # module.media_api.aws_api_gateway_resource.devices will be created
  + resource "aws_api_gateway_resource" "devices" {
      + id          = (known after apply)
      + parent_id   = "56d9f0jtmj"
      + path        = (known after apply)
      + path_part   = "devices"
      + region      = "ap-northeast-1"
      + rest_api_id = "vtz8vfq85g"
    }

  # module.media_api.aws_api_gateway_resource.devices_token will be created
  + resource "aws_api_gateway_resource" "devices_token" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "token"
      + region      = "ap-northeast-1"
      + rest_api_id = "vtz8vfq85g"
    }

  # module.media_api.aws_api_gateway_stage.media will be updated in-place
  ~ resource "aws_api_gateway_stage" "media" {
      ~ deployment_id         = "lq2p3l" -> (known after apply)
        id                    = "ags-vtz8vfq85g-dev"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # module.media_api.aws_cloudwatch_log_group.lambda["register_device_token"] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/cloud-photos-dev-register-device-token"
      + name_prefix                 = (known after apply)
      + region                      = "ap-northeast-1"
      + retention_in_days           = 14
      + skip_destroy                = false
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
    }

  # module.media_api.aws_cloudwatch_log_group.lambda["unregister_device_token"] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/cloud-photos-dev-unregister-device-token"
      + name_prefix                 = (known after apply)
      + region                      = "ap-northeast-1"
      + retention_in_days           = 14
      + skip_destroy                = false
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
    }

  # module.media_api.aws_iam_role.register_device_token will be created
  + resource "aws_iam_role" "register_device_token" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloud-photos-dev-register-device-token-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.media_api.aws_iam_role.unregister_device_token will be created
  + resource "aws_iam_role" "unregister_device_token" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloud-photos-dev-unregister-device-token-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.media_api.aws_iam_role_policy.register_device_token_dynamodb will be created
  + resource "aws_iam_role_policy" "register_device_token_dynamodb" {
      + id          = (known after apply)
      + name        = "dynamodb-put"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ap-northeast-1:***:table/cloud-photos-device-tokens-dev"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.media_api.aws_iam_role_policy.register_device_token_logs will be created
  + resource "aws_iam_role_policy" "register_device_token_logs" {
      + id          = (known after apply)
      + name        = "cloudwatch-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.media_api.aws_iam_role_policy.unregister_device_token_dynamodb will be created
  + resource "aws_iam_role_policy" "unregister_device_token_dynamodb" {
      + id          = (known after apply)
      + name        = "dynamodb-delete"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ap-northeast-1:***:table/cloud-photos-device-tokens-dev"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.media_api.aws_iam_role_policy.unregister_device_token_logs will be created
  + resource "aws_iam_role_policy" "unregister_device_token_logs" {
      + id          = (known after apply)
      + name        = "cloudwatch-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.media_api.aws_lambda_function.register_device_token will be created
  + resource "aws_lambda_function" "register_device_token" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/media_api/../../.build/device_tokens.zip"
      + function_name                  = "cloud-photos-dev-register-device-token"
      + handler                        = "register_device_token.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "8MIwvd+GSymo6ej2fOx5w/sPMJI1Zg6T6glzJOc+vHg="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "cloud-photos-device-tokens-dev"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.media_api.aws_lambda_function.unregister_device_token will be created
  + resource "aws_lambda_function" "unregister_device_token" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/media_api/../../.build/device_tokens.zip"
      + function_name                  = "cloud-photos-dev-unregister-device-token"
      + handler                        = "unregister_device_token.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "8MIwvd+GSymo6ej2fOx5w/sPMJI1Zg6T6glzJOc+vHg="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "cloud-photos-device-tokens-dev"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.media_api.aws_lambda_permission.delete_devices_token will be created
  + resource "aws_lambda_permission" "delete_devices_token" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-photos-dev-unregister-device-token"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:***:vtz8vfq85g/*/DELETE/devices/token"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.media_api.aws_lambda_permission.put_devices_token will be created
  + resource "aws_lambda_permission" "put_devices_token" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-photos-dev-register-device-token"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:***:vtz8vfq85g/*/PUT/devices/token"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

Plan: 23 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<!-- terraform-plan-dev -->